app/controllers/api/items_controller.rb

SELECT  "people".* FROM "people" WHERE "people"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def index
        @people = User.find(params[:user_id]).people