app/controllers/api/items_controller.rb

    def index
        if params[:person_id]
            @items = Person.find(params[:person_id]).items.reverse
            render json: @items
        elsif params[:user_id]
            @items = User.find(params[:user_id]).items.reverse
---
SELECT "items".* FROM "items" WHERE "items"."person_id" = $1  [["person_id", 7]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1  [["user_id", 31]]

    def create
        @user = User.find(params[:user_id])
        @person = Person.find(params[:person_id])
        @item = Item.create!(item_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "items" ("name", "user_id", "person_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Book"], ["user_id", 4], ["person_id", 7], ["created_at", "2017-11-13 17:12:51.729502"], ["updated_at", "2017-11-13 17:12:51.729502"]]

    def update
        @item = Item.find(params[:id])
        @item.update!(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "items" SET "name" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["name", "Books"], ["updated_at", "2017-11-13 17:13:54.325560"], ["id", 7]]

    def destroy
        @item = Item.find(params[:id]).delete
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 7]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]