app/controllers/api/people_controller.rb

    def index
        puts 'route hit'
        @people = User.find(params[:user_id]).people.distinct
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT DISTINCT "people".* FROM "people" INNER JOIN "items" ON "people"."id" = "items"."person_id" WHERE "items"."user_id" = $1  [["user_id", 42]]

    def create
        @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]