app/controllers/api/users_controller.rb

    def show
        if params[:id][0]  =~ /[A-Za-z]/
            @user = User.find_by_username(params[:id])
            render json: @user
        else
            @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Hunter"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @user = User.create!(user_params)
---
INSERT INTO "users" ("email", "username", "password", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "email@email.com"], ["username", "Alex"], ["password", "password3"], ["picture", ""], ["created_at", "2017-11-13 20:15:54.544798"], ["updated_at", "2017-11-13 20:15:54.544798"]]

    def update
        @user = User.find(params[:id])
        @user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "holder@place.com"], ["updated_at", "2017-11-16 21:17:59.611518"], ["id", 42]]

    def destroy
        @user = User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 43]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]